PrestoDL/Project_S32K_Vehicle/code/Uwave수정.c
#define PTA1	1
#define PTA2	2
#define PTA3    3
#define PTA11   11
#define PTA12   12
#define PTA6    6

#define PTB0    0
#define PTB1    1
#define PTB2    2
#define PTB3    3	//VR&CDS 용, 만약 제대로 동작하지 않는다면 메인 보드 가변저항으로 대체
#define PTB4	4

//#define PTC0    0 // 사용 안 할 예정
//#define PTC1    1 // 사용 안 할 예정
//#define PTC2    2 // 사용 안 할 예정
//#define PTC3    3 // 사용 안 할 예정

#define PTD0    0
#define PTD7    7
#define PTD2    2
#define PTD3    3
#define PTD4    4
#define PTD5    5
#define PTD6    6

#define PTD14	14 /////////// Servo Motor PWM 추가
#define PTD15   15 /////////// DC Motor(D) PWM 추가
#define PTD16   16 /////////// DC Motor(R) PWM 추가


#define PTE0    0
#define PTE1    1
#define PTE2    2
#define PTE3    3
#define PTE8    8
#define PTE5    5
#define PTE6    6
#define PTE7    7

#define MaxSpd	100 // can be modified

int time = 0; // unit : 0.01s
int lastStepTime = 0; // for checking time difference
float velocity = 0; // 0.00000 ~

int handleAngle; // 0 ~ 2047 ~ 4095
int blinkerSwitch = 1; // 0, 1, 2 : left, idle, right
int blinkerTime; // 0 ~
int wiperSwitch = 0; // 0, 1 : wiper off, wiper on
int uWaveDetect = 0; // 0, 1 : not detected, detected
int brakeLED = 0; // 0, 1 : no brake, brake

int SelectGearForwardBackward = 1; // 0, 1 : Backward, Forward  ////////// 추가 한구
int SelectPiezoGear = 0;

float uWaveDistance = 0;
int uWaveCount = 0;
int uWaveLevelHigh = 0;

#define P	0
#define N	1
#define R	2
#define	D	3
#define PTB12	12//Digit4
#define PTC13	13//Parking
volatile uint8_t GEARSET = P;
#define PTD16	16//servo ftm0 ch 1
#define PTB17	17//buzzer
#define	PTD12	12//forward FTM2 CH2
#define PTD14	14//backward FTM2 CH5

#define PTA7	7//uWave Echo
#define PTA8	8//uWave trig

void PORT_init() {

   PCC_PORTA |= (1 << CGC_BIT);

   PORTA_PCR1 &= ~((0b111) << MUX_BITS);///////////////////////////////////// 한구 사용 예정
   PORTA_PCR1 |= (1 << MUX_BITS);//////////////////////////////////////////// 한구 사용 예정

   PORTA_PCR1 &= ~((0b1111)<<IRQC_BITS); /////////////////////////////////// 한구 추가
   PORTA_PCR1 |= ((0b1001)<<IRQC_BITS); /////////////////////////////////// 한구 추가

   PORTA_PCR2 &= ~((0b111) << MUX_BITS);
   PORTA_PCR2 |= (1 << MUX_BITS);
   PORTA_PCR3 &= ~((0b111) << MUX_BITS);
   PORTA_PCR3 |= (1 << MUX_BITS);
   PORTA_PCR11 &= ~((0b111) << MUX_BITS);
   PORTA_PCR11 |= (1 << MUX_BITS);
   PORTA_PCR12 &= ~((0b111) << MUX_BITS);
   PORTA_PCR12 |= (1 << MUX_BITS);

   PORTA_PCR7 &= ~((0b111) << MUX_BITS);
   PORTA_PCR7 |= (1 << MUX_BITS);
   PORTA_PCR8 &= ~((0b111) << MUX_BITS);
   PORTA_PCR8 |= (1 << MUX_BITS);

   GPIOA_PDDR |= (1 << PTA8);
   GPIOA_PDDR &= ~(1 << PTA7);
   GPIOA_PDDR &= ~(1 << PTA1) & ~(1 << PTA2) & ~(1 << PTA3) & ~(1 << PTA11) & ~(1 << PTA12); // input



   PCC_PORTB |= (1 << CGC_BIT);

   PORTB_PCR0 &= ~((0b111) << MUX_BITS);
   PORTB_PCR0 |= (1 << MUX_BITS);
   PORTB_PCR1 &= ~((0b111) << MUX_BITS);
   PORTB_PCR1 |= (1 << MUX_BITS);
   PORTB_PCR2 &= ~((0b111) << MUX_BITS);
   PORTB_PCR2 |= (1 << MUX_BITS);
   PORTB_PCR4 &= ~((0b111) << MUX_BITS);
   PORTB_PCR4 |= (1 << MUX_BITS);
   PORTB_PCR12 &= ((0b111) << MUX_BITS);
   PORTB_PCR12 |= (1 << MUX_BITS);

   PORTB_PCR3 &= ~((0b111)<<MUX_BITS);	////////////////////// VR&CDS 용, 만약 메인보드 가변 저항 사용시, 주석처리
   PORTB_PCR3 |= ((0b010)<<MUX_BITS);	////////////////////// VR&CDS 용, 만약 메인보드 가변 저항 사용시, 주석처리
   PORTB_PCR17 &= ~((0b111)<<MUX_BITS);
   PORTB_PCR17 |= ((0b001)<<MUX_BITS);

   GPIOB_PDDR |= (1 << PTB0) | (1 << PTB1) | (1 << PTB2) | (1 << PTB12) | (1 << PTB17); // output



   PCC_PORTC |= (1 << CGC_BIT);
   PORTC_PCR13 &= ~((0b111) << MUX_BITS);
   PORTC_PCR13 |= (1 << MUX_BITS);

   GPIOC_PDDR &= ~(1 << PTC13);

   PORTC_PCR13 &= ~((0b1111)<<IRQC_BITS);
   PORTC_PCR13 |= ((0b1001)<<IRQC_BITS);

   PCC_PORTD |= (1 << CGC_BIT);

   PORTD_PCR0 &= ~((0b111) << MUX_BITS);
   PORTD_PCR0 |= (1 << MUX_BITS);
   PORTD_PCR7 &= ~((0b111) << MUX_BITS);
   PORTD_PCR7 |= (1 << MUX_BITS);
   PORTD_PCR2 &= ~((0b111) << MUX_BITS);
   PORTD_PCR2 |= (1 << MUX_BITS);
   PORTD_PCR3 &= ~((0b111) << MUX_BITS);
   PORTD_PCR3 |= (1 << MUX_BITS);
   PORTD_PCR4 &= ~((0b111) << MUX_BITS);
   PORTD_PCR4 |= (1 << MUX_BITS);
   PORTD_PCR5 &= ~((0b111) << MUX_BITS);
   PORTD_PCR5 |= (1 << MUX_BITS);
   PORTD_PCR6 &= ~((0b111) << MUX_BITS);
   PORTD_PCR6 |= (1 << MUX_BITS);

   ////////////////////////////////////////// 추가
   PORTD_PCR12 &= ~((0b111)<<MUX_BITS);
   PORTD_PCR12 |= ((0b010)<<MUX_BITS);

   PORTD_PCR14 &= ~((0b111)<<MUX_BITS);
   PORTD_PCR14 |= ((0b010)<<MUX_BITS);

   PORTD_PCR16 &= ~((0b111)<<MUX_BITS);
   PORTD_PCR16 |= ((0b010)<<MUX_BITS);
   //////////////////////////////////////////

   GPIOD_PDDR |= (1 << PTD0) | (1 << PTD7) | (1 << PTD2) | (1 << PTD3) | (1 << PTD4) | (1 << PTD5) | (1 << PTD6); // output

   PCC_PORTE |= (1 << CGC_BIT);

   PORTE_PCR0 &= ~((0b111) << MUX_BITS);
   PORTE_PCR0 |= (1 << MUX_BITS);
   PORTE_PCR1 &= ~((0b111) << MUX_BITS);
   PORTE_PCR1 |= (1 << MUX_BITS);
   PORTE_PCR2 &= ~((0b111) << MUX_BITS);
   PORTE_PCR2 |= (1 << MUX_BITS);
   PORTE_PCR3 &= ~((0b111) << MUX_BITS);
   PORTE_PCR3 |= (1 << MUX_BITS);
   PORTE_PCR8 &= ~((0b111) << MUX_BITS);
   PORTE_PCR8 |= (1 << MUX_BITS);
   PORTE_PCR5 &= ~((0b111) << MUX_BITS);
   PORTE_PCR5 |= (1 << MUX_BITS);
   PORTE_PCR6 &= ~((0b111) << MUX_BITS);
   PORTE_PCR6 |= (1 << MUX_BITS);
   PORTE_PCR7 &= ~((0b111) << MUX_BITS);
   PORTE_PCR7 |= (1 << MUX_BITS);

   GPIOE_PDDR |= (1 << PTE0) | (1 << PTE1) | (1 << PTE2) | (1 << PTE3) | (1 << PTE8) | (1 << PTE5) | (1 << PTE6) | (1 << PTE7); // output
}



void set7segmentNumClear() {

   GPIOD_PCOR |= (1 << PTD0) | (1 << PTD7) | (1 << PTD2) | (1 << PTD3) | (1 << PTD4) | (1 << PTD5) | (1 << PTD6);
}

void set7segmentNum0() {
   GPIOD_PSOR |= (1 << PTD0) | (1 << PTD7) | (1 << PTD2) | (1 << PTD3) | (1 << PTD4) | (1 << PTD5);
   GPIOD_PCOR |= (1 << PTD6);
}

void set7segmentNum1() {
   GPIOD_PSOR |= (1 << PTD7) | (1 << PTD2);
   GPIOD_PCOR |= (1 << PTD0) | (1 << PTD3) | (1 << PTD4) | (1 << PTD5) | (1 << PTD6);
}

void set7segmentNum2() {
   GPIOD_PSOR |= (1 << PTD0) | (1 << PTD7) | (1 << PTD3) | (1 << PTD4) | (1 << PTD6);
   GPIOD_PCOR |= (1 << PTD2) | (1 << PTD5);
}

void set7segmentNum3() {
   GPIOD_PSOR |= (1 << PTD0) | (1 << PTD7) | (1 << PTD2) | (1 << PTD3) | (1 << PTD6);
   GPIOD_PCOR |= (1 << PTD4) | (1 << PTD5);
}

void set7segmentNum4() {
   GPIOD_PSOR |= (1 << PTD7) | (1 << PTD2) | (1 << PTD5) | (1 << PTD6);
   GPIOD_PCOR |= (1 << PTD0) | (1 << PTD3) | (1 << PTD4);
}

void set7segmentNum5() {
   GPIOD_PSOR |= (1 << PTD0) | (1 << PTD2) | (1 << PTD3) | (1 << PTD5) | (1 << PTD6);
   GPIOD_PCOR |= (1 << PTD7) | (1 << PTD4);
}

void set7segmentNum6() {
   GPIOD_PSOR |= (1 << PTD0) | (1 << PTD2) | (1 << PTD3) | (1 << PTD4) | (1 << PTD5) | (1 << PTD6);
   GPIOD_PCOR |= (1 << PTD7);
}

void set7segmentNum7() {
   GPIOD_PSOR |= (1 << PTD0) | (1 << PTD7) | (1 << PTD2) | (1 << PTD5);
   GPIOD_PCOR |= (1 << PTD3) | (1 << PTD4) | (1 << PTD6);
}

